# OpenDocumentFile Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationEntryPoint..::..OpenDocumentFile Method
ApplicationEntryPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| OpenDocumentFile(String) | Opens a document from disk.  (Inherited from Application.) |
| OpenDocumentFile(ModelPath, OpenOptions) | Opens a document from disk or cloud.  (Inherited from Application.) |
| OpenDocumentFile(ModelPath, OpenOptions, IOpenFromCloudCallback) | Opens a document from disk or cloud.  (Inherited from Application.) |

# See Also
ApplicationEntryPoint Class
ApplicationEntryPoint Members
Autodesk.Revit.DB.Macros Namespace